{
	"intents": [{
			"tag": "Intro",
			"patterns": ["hi",
				"how are you",
				"is anyone there",
				"how r u",
				"hello",
				"who's there",
				"whats up",
				"hey",
				"yo",
				"listen",
				"please help me",
				"i am learner from",
				"i belong to",
				"aiml batch",
				"aifl batch",
				"i am from",
				"my pm is",
				"blended",
				"online",
				"i am from",
				"hey ya",
				"Hi", "Hey", "Is anyone there?", "Hello", "Hay",
				"talking to you for first time",
				"good morning",
				"good afternoon",
				"good evening"
			],
			"responses": ["Hello", "Hi", "Hi there", "Hello! how can i help you ?", "good morning",
				"good afternoon",
				"good evening"
			],
			"context_set": ""
		},
		{
			"tag": "Exit",
			"patterns": ["thank you",
				"thanks",
				"cya",
				"see you",
				"later",
				"see you later",
				"goodbye",
				"i am leaving",
				"have a Good day",
				"you helped me",
				"thanks a lot",
				"thanks a ton",
				"you are the best",
				"great help",
				"too good",
				"bye bye",
				"good bye",
				"you are a good learning buddy", "Thanks", "Thank you", "That's helpful", "Thanks for the help"
			],
			"responses": ["I hope I was able to assist you, Good Bye", "Happy to help!", "Any time!", "My pleasure", "You're most welcome!"],
			"context_set": ""
		},
		{
			"tag": "Olympus",
			"patterns": ["olympus",
				"explain me how olympus works",
				"I am not able to understand olympus",
				"olympus window not working",
				"no access to olympus",
				"unable to see link in olympus",
				"no link visible on olympus",
				"whom to contact for olympus",
				"lot of problem with olympus",
				"olypus is not a good tool",
				"lot of problems with olympus",
				"how to use olympus",
				"teach me olympus"
			],
			"responses": ["Link: Olympus wiki"],
			"context_set": ""
		},
		{
			"tag": "SL",
			"patterns": ["i am not able to understand svm",
				"explain me how machine learning works",
				"i am not able to understand naive bayes",
				"i am not able to understand logistic regression",
				"i am not able to understand ensemble techb=niques",
				"i am not able to understand knn",
				"i am not able to understand knn imputer",
				"i am not able to understand cross validation",
				"i am not able to understand boosting",
				"i am not able to understand random forest",
				"i am not able to understand ada boosting",
				"i am not able to understand gradient boosting",
				"help me with machine learning",
				"i need help with machine learning",
				"machine learning",
				"ML",
				"SL",
				"svm",
				"supervised learning",
				"knn",
				"logistic regression",
				"regression",
				"classification",
				"naive bayes",
				"nb",
				"ensemble techniques",
				"bagging",
				"boosting",
				"ada boosting",
				"ada",
				"gradient boosting",
				"hyper parameters",
				"A hyperparameter is a constant parameter whose value is set before the learning process begins.",
				"The values of parameters are derived via learning. ",
				"Examples of hyperparameters include learning rate, the number of hidden layers and batch size.",
				"Machine learning (ML) is the study of computer algorithms that improve automatically through experience and by the use of data.",
				"It is seen as a part of artificial intelligence.",
				"Machine learning algorithms build a model based on sample data, known as training data, in order to make predictions or decisions without being explicitly programmed to do so.",
				"[2] Machine learning algorithms are used in a wide variety of applications, such as in medicine, email filtering, speech recognition, and computer vision, where it is difficult or unfeasible to develop conventional algorithms to perform the needed tasks.",
				"A subset of machine learning is closely related to computational statistics, which focuses on making predictions using computers; but not all machine learning is statistical learning.",
				"The study of mathematical optimization delivers methods, theory and application domains to the field of machine learning.",
				"Data mining is a related field of study, focusing on exploratory data analysis through unsupervised learning.",
				"[5][6] In its application across business problems, machine learning is also referred to as predictive analytics",
				"Supervised learning algorithms build a mathematical model of a set of data that contains both the inputs and the desired outputs.",
				"[38] The data is known as training data, and consists of a set of training examples. ",
				"Each training example has one or more inputs and the desired output, also known as a supervisory signal.",
				"In the mathematical model, each training example is represented by an array or vector, sometimes called a feature vector, and the training data is represented by a matrix. ",
				"Through iterative optimization of an objective function, supervised learning algorithms learn a function that can be used to predict the output associated with new inputs.",
				"An optimal function will allow the algorithm to correctly determine the output for inputs that were not a part of the training data.",
				"An algorithm that improves the accuracy of its outputs or predictions over time is said to have learned to perform that task.",
				"Types of supervised learning algorithms include active learning, classification and regression.",
				"Classification algorithms are used when the outputs are restricted to a limited set of values, and regression algorithms are used when the outputs may have any numerical value within a range.",
				"As an example, for a classification algorithm that filters emails, the input would be an incoming email, and the output would be the name of the folder in which to file the email.",
				"Similarity learning is an area of supervised machine learning closely related to regression and classification, but the goal is to learn from examples using a similarity function that measures how similar or related two objects are.",
				"It has applications in ranking, recommendation systems, visual identity tracking, face verification, and speaker verification.",
				"Decision tree learning uses a decision tree as a predictive model to go from observations about an item (represented in the branches) to conclusions about the item's target value (represented in the leaves). ",
				"It is one of the predictive modeling approaches used in statistics, data mining, and machine learning.",
				"Tree models where the target variable can take a discrete set of values are called classification trees; in these tree structures, leaves represent class labels and branches represent conjunctions of features that lead to those class labels.",
				"Decision trees where the target variable can take continuous values (typically real numbers) are called regression trees.",
				"In decision analysis, a decision tree can be used to visually and explicitly represent decisions and decision making.",
				"In data mining, a decision tree describes data, but the resulting classification tree can be an input for decision making.",
				"Support-vector machines (SVMs), also known as support-vector networks, are a set of related supervised learning methods used for classification and regression.",
				"Given a set of training examples, each marked as belonging to one of two categories, an SVM training algorithm builds a model that predicts whether a new example falls into one category or the other. ",
				"An SVM training algorithm is a non-probabilistic, binary, linear classifier, although methods such as Platt scaling exist to use SVM in a probabilistic classification setting.",
				"In addition to performing linear classification, SVMs can efficiently perform a non-linear classification using what is called the kernel trick, implicitly mapping their inputs into high-dimensional feature spaces.",
				"A Bayesian network, belief network, or directed acyclic graphical model is a probabilistic graphical model that represents a set of random variables and their conditional independence with a directed acyclic graph (DAG). ",
				"For example, a Bayesian network could represent the probabilistic relationships between diseases and symptoms. ",
				"Given symptoms, the network can be used to compute the probabilities of the presence of various diseases.",
				"Efficient algorithms exist that perform inference and learning.",
				"Bayesian networks that model sequences of variables, like speech signals or protein sequences, are called dynamic Bayesian networks.",
				"Generalizations of Bayesian networks that can represent and solve decision problems under uncertainty are called influence diagrams",
				"kNN is a type of classification where the function is only approximated locally and all computation is deferred until function evaluation.",
				"Since this algorithm relies on distance for classification, if the features represent different physical units or come in vastly different scales then normalizing the training data can improve its accuracy dramatically."
			],
			"responses": ["Link: Machine Learning wiki "],
			"context_set": ""
		},

		{
			"tag": "NN",
			"patterns": ["what is deep learning",
				"unable to understand deep learning",
				"explain me how deep learning works",
				"i am not able to understand deep learning",
				"not able to understand neural nets",
				"very diffult to understand neural nets",
				"unable to understand neural nets",
				"ann",
				"help me with ann",
				"i need help with ann",
				"artificial intelligence",
				"artificial neural networks",
				"weights",
				"activation function",
				"hidden layers",
				"softmax",
				"sigmoid",
				"relu",
				"otimizer",
				"forward propagation",
				"backward propagation",
				"epochs",
				"epoch",
				"what is an epoch",
				"adam",
				"sgd",
				"learning rate",
				"cost function",
				"Backpropagation",
				"CNN",
				"Convolutional neural network",
				"optimiser",
				"losses",
				"regularizer",
				"layers",
				"dense layer",
				"Artificial neural networks (ANNs), or connectionist systems, are computing systems vaguely inspired by the biological neural networks that constitute animal brains.",
				"Such systems learn to perform tasks by considering examples, generally without being programmed with any task-specific rules.",
				"An ANN is a model based on a collection of connected units or nodes called artificial neurons, which loosely model the neurons in a biological brain. ",
				"Each connection, like the synapses in a biological brain, can transmit information, a signal, from one artificial neuron to another. ",
				"An artificial neuron that receives a signal can process it and then signal additional artificial neurons connected to it.",
				"In common ANN implementations, the signal at a connection between artificial neurons is a real number, and the output of each artificial neuron is computed by some non-linear function of the sum of its inputs.",
				"The connections between artificial neurons are called edge. ",
				"Artificial neurons and edges typically have a weight that adjusts as learning proceeds. ",
				"The weight increases or decreases the strength of the signal at a connection.",
				"Artificial neurons may have a threshold such that the signal is only sent if the aggregate signal crosses that threshold.",
				"Typically, artificial neurons are aggregated into layers.",
				"Different layers may perform different kinds of transformations on their inputs.",
				"Signals travel from the first layer (the input layer) to the last layer (the output layer), possibly after traversing the layers multiple times.",
				"The original goal of the ANN approach was to solve problems in the same way that a human brain would.",
				"However, over time, attention moved to performing specific tasks, leading to deviations from biology. ",
				"Artificial neural networks have been used on a variety of tasks, including computer vision, speech recognition, machine translation, social network filtering, playing board and video games and medical diagnosis.",
				"Deep learning consists of multiple hidden layers in an artificial neural network.",
				" This approach tries to model the way the human brain processes light and sound into vision and hearing.",
				"Some successful applications of deep learning are computer vision and speech recognition.",
				"An ANN is based on a collection of connected units or nodes called artificial neurons, which loosely model the neurons in a biological brain. ",
				"Each connection, like the synapses in a biological brain, can transmit a signal to other neurons. ",
				"An artificial neuron that receives a signal then processes it and can signal neurons connected to it. ",
				"The signal at a connection is a real number, and the output of each neuron is computed by some non-linear function of the sum of its inputs.",
				"The connections are called edges.",
				"Neurons and edges typically have a weight that adjusts as learning proceeds.",
				"The weight increases or decreases the strength of the signal at a connection. ",
				"Neurons may have a threshold such that a signal is sent only if the aggregate signal crosses that threshold.",
				"Typically, neurons are aggregated into layers.",
				"Different layers may perform different transformations on their inputs.",
				"Signals travel from the first layer (the input layer), to the last layer (the output layer), possibly after traversing the layers multiple times."

			],
			"responses": ["Link: Neural Nets wiki"],
			"context_set": ""
		},

		{
			"tag": "Bot",
			"patterns": ["what is your name",
				"who are you",
				"who r u",
				"name please",
				"what is ur name",
				"who is this?",
				"name pls",
				"A bot (a common nickname for software robot) is an automated tool that carries out repetitive and mundane tasks to maintain the 53,597,732 pages of the English Wikipedia.",
				"Bots are able to make edits very rapidly, but can disrupt Wikipedia if they are incorrectly designed or operated. ",
				"There are currently 2,496 bot tasks approved for use on the English Wikipedia; however, not all approved tasks involve actively carrying out edits. ",
				"Bots will leave messages on user talk pages if the action that the bot has carried out is of interest to that editor.",
				"Some bots can be excluded from leaving these messages by using the bots tags.",
				"There is also a range of tools that allow semi-automated editing of large numbers of articles."
			],
			"responses": ["I am your virtual learning assistant"],
			"context_set": ""
		},
		{
			"tag": "timings",
			"patterns": [
				"when are your hours of opertions",
				"what are your working hours",
				"hours of operation",
				"working hours",
				"hours",
				"when r ur hrs of operations",
				"working hrs?",
				"hrs",
				"clocks",
				"working time",
				"timings",
				"time please"
			],
			"responses": ["9AM to 5PM"],
			"context_set": ""
		},
		{
			"tag": "Profane",
			"patterns": ["what the hell",
				"bloody stupid bot",
				"do you think you are very smart",
				"screw you",
				"i hate you",
				"you are stupid",
				"jerk",
				"you are a joke",
				"useless piece of shit",
				"this is a joke",
				"not satisfactory",
				"not good",
				"did not answer",
				"u r stupid",
				"i hate u",
				"u r a joke",
				"screw u",
				"do u think u r very smart",
				"idiot",
				"stupid",
				"very much stupid"
			],
			"responses": ["Please use respectful words"],
			"context_set": ""
		},

		{
			"tag": "Ticket",
			"patterns": ["my problem is not solved",
				"you did not help me",
				"not a good solution",
				"bad solution",
				"not good solution",
				"no help",
				"wasted my time",
				"useless bot",
				"create a ticket"
			],
			"responses": ["Tarnsferring the request to your PM"],
			"context_set": ""
		}
	]
}